//
// Created by whj on 2024/1/10.
//
#include <iostream>

/**
 * 参考C语言手册:ASCII 和 转义字符章节
 * https://c-cpp.com/c/language/escape.html
 */

int main() {

    /**
     * 转义字符: 一看到 \ 就把 \ 和 后面紧跟着的 当做特殊的转义符.
     * 如: 水平制表 \t  tab 键.
     *     换行 \n   换行符.
     *   比如在一个字符串的打印中要来一个 \  符号, 但是计算机一看到 \ 就把\后面紧跟着的 当做转义符号看你要干啥.
     *   所以此时 如果要来个\\ 才能在字符中看到一个\ .
     *   字符串中 出现 " 也要转义
     */
    printf("Hello\\World \n"); //Hello\World

    printf("Hello\" World \n"); //Hello" World 把" 当做字符串中的字符打印出来.

    char c1 = '"'; //注意 字符是 单引号括起来的. , 此处的 c1 表达的就是 一个字符"
    char c2 = '\''; //如果就想一个 单引号 ' 需要来转义.
    printf("c1 = %c c2 = %c \n", c1, c2);


    /**
     * \nnn   任意8 进制 , 内存中字节 就是 nnn
     * \xnn   任意16进制 , 内存中字节 nn.  x表示十六进制. x 是小写.
     */
    char c3 = '\023'; //2*8 + 3 = 19
    printf("c3=%d , c3 = %c \n",c3,c3); //c3=19

    char c4 = '\063'; //6*8 + 3 = 48 + 3 = 51 . 51存在内存中是二进制的形式.
    printf("c4 = %d , %c \n", c4, c4);
    // c4 = 51 , 3  //%d 就是以10进制的形式把内存中二进制展示出来.
    // %c 是字符形式展示出来, 51 字符形式就是3 字符'0' 48

    char c5 = '\x63'; //xnn 任意16进制 内存中字节为 nn .
    printf("c5 = %d %x %c \n",c5,c5,c5); //c5 = 99 63 c


    printf("MJ = \115\x4A \n"); //MJ

    char c6 = '\011'; //8进制 11 查表字符代表\t 横向的制表符
    printf("c6 = %o %c %d \n",c6,c6,c6); //c6 = 11 (看不见的制表符) 9
    printf("\0115"); // "\nnn" '\011' 和 '5' 组合.

    return 0;
}